stm32-hotspot/STM32WBA-BLE-HeartRate-FreeRTOS/Projects/NUCLEO-WBA55CG/Applications/BLE/BLE_HeartRateFreeRTOS/Core/Src/app_entry.c
  DbgIOsInit.Mode = GPIO_MODE_ANALOG;
  DbgIOsInit.Pull = GPIO_NOPULL;
  DbgIOsInit.Pin = GPIO_PIN_3|GPIO_PIN_4;
  __HAL_RCC_GPIOB_CLK_ENABLE();
  HAL_GPIO_Init(GPIOB, &DbgIOsInit);
#endif /* CFG_DEBUGGER_LEVEL */

#if (CFG_LPM_LEVEL != 0)
  /* Initialize low Power Manager. By default enabled */
  UTIL_LPM_Init();

#if (CFG_LPM_STDBY_SUPPORTED == 1)
  /* Enable SRAM1, SRAM2 and RADIO retention*/
  LL_PWR_SetSRAM1SBRetention(LL_PWR_SRAM1_SB_FULL_RETENTION);
  LL_PWR_SetSRAM2SBRetention(LL_PWR_SRAM2_SB_FULL_RETENTION);
  LL_PWR_SetRadioSBRetention(LL_PWR_RADIO_SB_FULL_RETENTION); /* Retain sleep timer configuration */

#else /* (CFG_LPM_STDBY_SUPPORTED == 1) */
  UTIL_LPM_SetOffMode(1U << CFG_LPM_APP, UTIL_LPM_DISABLE);
#endif /* (CFG_LPM_STDBY_SUPPORTED == 1) */
#endif /* (CFG_LPM_LEVEL != 0)  */

  /* USER CODE BEGIN SystemPower_Config */

  /* USER CODE END SystemPower_Config */
}

static void HW_RNG_Process_Task(void *argument)
{
  for(;;)
  {
    osSemaphoreAcquire(HwRngSemaphore, osWaitForever);
    osMutexAcquire(LinkLayerMutex, osWaitForever);
    HW_RNG_Process();
    osMutexRelease(LinkLayerMutex);
    osThreadYield();
  }
}

/**
 * @brief Initialize Random Number Generator module
 */
static void RNG_Init(void)
{
  HW_RNG_Start();

  /* Register Semaphore to launch the Random Process */
  HwRngSemaphore = osSemaphoreNew(1U, 0U, NULL );
  if ( HwRngSemaphore == NULL )
  {
    APP_DBG( "ERROR FREERTOS : RANDOM PROCESS SEMAPHORE CREATION FAILED" );
    while(1);
  }

  /* Create the Random Process Thread */
  const osThreadAttr_t HwRngTask_attributes = {
    .name = "RNG Task",
    .priority = (osPriority_t) HW_RNG_TASK_PRIO,
    .stack_size = HW_RNG_TASK_STACK_SIZE
  };
  HwRngThread = osThreadNew( HW_RNG_Process_Task, NULL, &HwRngTask_attributes );
  if ( HwRngThread == NULL )
  {
    APP_DBG( "ERROR FREERTOS : RANDOM PROCESS THREAD CREATION FAILED" );
    while(1);
  }
}

static void AMM_WrapperInit (uint32_t * const p_PoolAddr, const uint32_t PoolSize)
{
  UTIL_MM_Init ((uint8_t *)p_PoolAddr, ((size_t)PoolSize * sizeof(uint32_t)));
}

static uint32_t * AMM_WrapperAllocate (const uint32_t BufferSize)
{
  return (uint32_t *)UTIL_MM_GetBuffer (((size_t)BufferSize * sizeof(uint32_t)));
}

static void AMM_WrapperFree (uint32_t * const p_BufferAddr)
{
  UTIL_MM_ReleaseBuffer ((void *)p_BufferAddr);
}

/* OS tick callback */
static void TimerOStickCB(void *arg)
{
  xPortSysTickHandler();
  /* USER CODE BEGIN TimerOStickCB */
  HAL_IncTick();
  /* USER CODE END TimerOStickCB */

  return;
}

/* OS wakeup callback */
static void TimerOSwakeupCB(void *arg)
{
  /* USER CODE BEGIN TimerOSwakeupCB */

  /* USER CODE END TimerOSwakeupCB */
  return;
}

#if ( CFG_LPM_LEVEL != 0)
static void preOSsleepProcessing(uint32_t expectedIdleTime)
{
  LL_PWR_ClearFlag_STOP();

  if ( ( system_startup_done != FALSE ) && ( UTIL_LPM_GetMode() == UTIL_LPM_OFFMODE ) )
  {
    APP_SYS_BLE_EnterDeepSleep();
  }

  LL_RCC_ClearResetFlags();

#if defined(STM32WBAXX_SI_CUT1_0)
  /* Wait until HSE is ready */
  while (LL_RCC_HSE_IsReady() == 0);

  UTILS_ENTER_LIMITED_CRITICAL_SECTION(RCC_INTR_PRIO << 4U);
  scm_hserdy_isr();
  UTILS_EXIT_LIMITED_CRITICAL_SECTION();
#endif /* STM32WBAXX_SI_CUT1_0 */

  UTIL_LPM_EnterLowPower(); /* WFI instruction call is inside this API */
}

static void postOSsleepProcessing(uint32_t expectedIdleTime)
{
  UTIL_TIMER_Stop(&TimerOSwakeup_Id);

  LL_AHB5_GRP1_EnableClock(LL_AHB5_GRP1_PERIPH_RADIO);
  ll_sys_dp_slp_exit();
}

/* return current time since boot, continue to count in standby low power mode */
static uint32_t getCurrentTime(void)
{
  return TIMER_IF_GetTimerValue();
}
#endif /* ( CFG_LPM_LEVEL != 0) */

/* USER CODE BEGIN FD_LOCAL_FUNCTIONS */
#if (CFG_LED_SUPPORTED == 1)
static void Led_Init( void )
{
  /* Leds Initialization */
  BSP_LED_Init(LED_BLUE);
  BSP_LED_Init(LED_GREEN);
  BSP_LED_Init(LED_RED);

  BSP_LED_On(LED_GREEN);

  return;
}
#endif

#if (CFG_BUTTON_SUPPORTED == 1)
static void Button_Init( void )
{
  /* Button Initialization */
  buttonDesc[B1].button = B1;
  buttonDesc[B2].button = B2;
  buttonDesc[B3].button = B3;
  BSP_PB_Init(B1, BUTTON_MODE_EXTI);
  BSP_PB_Init(B2, BUTTON_MODE_EXTI);
  BSP_PB_Init(B3, BUTTON_MODE_EXTI);
  
  /* Create semaphores and tasks associated to buttons */
  const osSemaphoreAttr_t Button1Semaphore_attributes = {
    .name = "Button1Semaphore"
  };
  Button1Semaphore = osSemaphoreNew(1U, 0U, &Button1Semaphore_attributes);
  if (Button1Semaphore == NULL)
  {
    Error_Handler();
  }
  const osThreadAttr_t Button1Thread_attributes = {
    .name = "Button1 Task",
    .priority = (osPriority_t)BUTTONS_TASK_PRIO,
    .stack_size = BUTTONS_TASK_STACK_SIZE
  };
  Button1Thread = osThreadNew(APPE_Button1Action_Entry, NULL, &Button1Thread_attributes);
  if (Button1Thread == NULL)
  {
    Error_Handler();
  }
  
  const osSemaphoreAttr_t Button2Semaphore_attributes = {
    .name = "Button2Semaphore"
  };
  Button2Semaphore = osSemaphoreNew(1U, 0U, &Button2Semaphore_attributes);
  if (Button2Semaphore == NULL)
  {
    Error_Handler();
  }
  const osThreadAttr_t Button2Thread_attributes = {
    .name = "Button2 Task",
    .priority = (osPriority_t)BUTTONS_TASK_PRIO,
    .stack_size = BUTTONS_TASK_STACK_SIZE
  };
  Button2Thread = osThreadNew(APPE_Button2Action_Entry, NULL, &Button2Thread_attributes);
  if (Button2Thread == NULL)
  {
    Error_Handler();
  }

  const osSemaphoreAttr_t Button3Semaphore_attributes = {
    .name = "Button3Semaphore"
  };
  Button3Semaphore = osSemaphoreNew(1U, 0U, &Button3Semaphore_attributes);
  if (Button3Semaphore == NULL)
  {
    Error_Handler();
  }
  const osThreadAttr_t Button3Thread_attributes = {
    .name = "Button3 Task",
    .priority = (osPriority_t)BUTTONS_TASK_PRIO,
    .stack_size = BUTTONS_TASK_STACK_SIZE
  };
  Button3Thread = osThreadNew(APPE_Button3Action_Entry, NULL, &Button3Thread_attributes);
  if (Button3Thread == NULL)
  {
    Error_Handler();
  }

  /* Create timers to detect button long press (one for each button) */
  Button_TypeDef buttonIndex;
  for ( buttonIndex = B1; buttonIndex < BUTTON_NB_MAX; buttonIndex++ )
  {
    UTIL_TIMER_Create( &buttonDesc[buttonIndex].longTimerId,
                       0,
                       UTIL_TIMER_ONESHOT,
                       &Button_TriggerActions,
                       &buttonDesc[buttonIndex] );
  }

  return;
}

static void Button_TriggerActions(void *arg)
{
  ButtonDesc_t *p_buttonDesc = arg;

  p_buttonDesc->longPressed = BSP_PB_GetState(p_buttonDesc->button);

  LOG_INFO_APP("Button %d pressed\n", (p_buttonDesc->button + 1));
  switch (p_buttonDesc->button)
  {
    case B1:
      osSemaphoreRelease(Button1Semaphore);
      break;
    case B2:
      osSemaphoreRelease(Button2Semaphore);
      break;
    case B3:
      osSemaphoreRelease(Button3Semaphore);
      break;
    default:
      break;
  }

  return;
}

static void APPE_Button1Action_Entry(void* thread_input)
{
  (void)(thread_input);
  
  while(1)
  {
    osSemaphoreAcquire(Button1Semaphore, osWaitForever);
    APPE_Button1Action();
    osThreadYield();
  }
}

static void APPE_Button2Action_Entry(void* thread_input)
{
  (void)(thread_input);
  
  while(1)
  {
    osSemaphoreAcquire(Button2Semaphore, osWaitForever);
    APPE_Button2Action();
    osThreadYield();
  }
}

static void APPE_Button3Action_Entry(void* thread_input)
{
  (void)(thread_input);
  
  while(1)
  {
    osSemaphoreAcquire(Button3Semaphore, osWaitForever);
    APPE_Button3Action();
    osThreadYield();
  }
}

#endif

